src/cf/InformationRegisters/swСформированныеПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>swСформированныеПечатныеФормы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяПечатнаяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомандаВнешнейПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетХранилищеВариантов</Name>
					<Comment>Когда Истина то дополнительный отчет подключен к хранилищу вариантов "ХранилищеВариантовОтчетов".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТеснаяИнтеграцияСФормойОтчета</Name>
					<Comment>Когда Истина то у отчета есть программный интерфейс для тесной интеграции с общей формой "ФормаОтчета".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСовместимостиРазрешений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗапуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВызоваДополнительныхОбработок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьОповещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗаданиеGUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемыеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПолноеИмяОбъектаМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разделы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьИмяРаздела</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРазрешения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/swКонтрольПечатиДокументов/Ext/Module.bsl
Процедура ПроверитьВозможностьПечатиДляПользователя(МассивОбъектов, ИменаМакетов, Параметры, Отказ) Экспорт
	ТаблицаФормируемыхПечатныхФорм = Новый ТаблицаЗначений;
	ТаблицаФормируемыхПечатныхФорм.Колонки.Добавить("СсылкаНаДокумент");
	ТаблицаФормируемыхПечатныхФорм.Колонки.Добавить("ИмяМакета");
	ТаблицаФормируемыхПечатныхФорм.Колонки.Добавить("ВнешняяПечатнаяФорма");
	ТаблицаФормируемыхПечатныхФорм.Колонки.Добавить("КомандаВнешнейПечатнойФормы");
	Если Не Параметры = Неопределено И ЗначениеЗаполнено(Параметры.ИсточникДанных) Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
			Для Каждого ОбъектНазначения Из Параметры.ПараметрыИсточника.ОбъектыНазначения Цикл
				Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектНазначения)) Тогда
					Если ПроверитьПравоНаФормированиеПечатнойФормы(ОбъектНазначения, "", Параметры.ИсточникДанных, Параметры.ПараметрыИсточника.ИдентификаторКоманды) Тогда
						НоваяСтрока = ТаблицаФормируемыхПечатныхФорм.Добавить();
						НоваяСтрока.СсылкаНаДокумент = ОбъектНазначения;
						НоваяСтрока.ИмяМакета = "";
						НоваяСтрока.ВнешняяПечатнаяФорма = Параметры.ИсточникДанных;
						НоваяСтрока.КомандаВнешнейПечатнойФормы = Параметры.ПараметрыИсточника.ИдентификаторКоманды;
					Иначе
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ТипЗнч(ИменаМакетов) = Тип("Строка") Тогда
			МассивИменМакетов = СтрРазделить(ИменаМакетов, ",");
		Иначе
			МассивИменМакетов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ИменаМакетов);
		КонецЕсли;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			Для Каждого ОбъектНазначения Из МассивОбъектов Цикл
				Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектНазначения)) Тогда
					Если ПроверитьПравоНаФормированиеПечатнойФормы(ОбъектНазначения, ИмяМакета, Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка(), "") Тогда
						НоваяСтрока = ТаблицаФормируемыхПечатныхФорм.Добавить();
						НоваяСтрока.СсылкаНаДокумент = ОбъектНазначения;
						НоваяСтрока.ИмяМакета = ИмяМакета;
						НоваяСтрока.ВнешняяПечатнаяФорма = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
						НоваяСтрока.КомандаВнешнейПечатнойФормы = "";
					Иначе
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если Не Отказ Тогда
		ЗарегистрироватьФормированиеПечатнойФормы(ТаблицаФормируемыхПечатныхФорм);
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьПравоНаФормированиеПечатнойФормы(СсылкаНаДокумент, ИмяМакета, ВнешняяПечатнаяФорма, КомандаВнешнейПечатнойФормы)
	Результат = Истина;
	Если Не РольДоступна("ПолныеПрава") И Константы.swОднократноеФормированиеПечатныхФорм.Получить() = Истина Тогда
		Запрос = Новый Запрос;
		Текст = "ВЫБРАТЬ
		        |	Данные.Дата КАК Дата,
		        |	Данные.Пользователь
		        |ИЗ
		        |	РегистрСведений.swСформированныеПечатныеФормы КАК Данные
		        |ГДЕ
		        |	Данные.СсылкаНаДокумент = &СсылкаНаДокумент
		        |	И Данные.ИмяМакета = &ИмяМакета
		        |	И Данные.ВнешняяПечатнаяФорма = &ВнешняяПечатнаяФорма
		        |	И Данные.КомандаВнешнейПечатнойФормы = &КомандаВнешнейПечатнойФормы
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Дата";
		Запрос.Текст = Текст;
		Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
		Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
		Запрос.УстановитьПараметр("ВнешняяПечатнаяФорма", ВнешняяПечатнаяФорма);
		Запрос.УстановитьПараметр("КомандаВнешнейПечатнойФормы", КомандаВнешнейПечатнойФормы);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Результат = Ложь;
			Если ЗначениеЗаполнено(ИмяМакета) Тогда
				Сообщить("Внимание! Печатная форма '" + ИмяМакета + "' документа '" + СсылкаНаДокумент + "' уже была сформирована ранее:");
			Иначе
				Сообщить("Внимание! Внешняя печатная форма '" + ВнешняяПечатнаяФорма + "' документа '" + СсылкаНаДокумент + "' по команде '" + КомандаВнешнейПечатнойФормы + "' уже была сформирована ранее:");
			КонецЕсли;
			Пока Выборка.Следующий() Цикл                                            
				Сообщить("    Дата формирования: " + Выборка.Дата + ", пользователь: '" + Выборка.Пользователь);
			КонецЦикла;
			Сообщить("Она не может быть вами сформирована повторно. Если вам действительно нужно ее сформировать, то обратитесь к администратору базу данных.");
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ЗарегистрироватьФормированиеПечатнойФормы(ТаблицаФормируемыхПечатныхФорм)
	Для Каждого СтрокаТаблицы Из ТаблицаФормируемыхПечатныхФорм Цикл
		МенеджерЗаписи = РегистрыСведений.swСформированныеПечатныеФормы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.СсылкаНаДокумент = СтрокаТаблицы.СсылкаНаДокумент;
		МенеджерЗаписи.ИмяМакета = СтрокаТаблицы.ИмяМакета;
		МенеджерЗаписи.ВнешняяПечатнаяФорма = СтрокаТаблицы.ВнешняяПечатнаяФорма;
		МенеджерЗаписи.КомандаВнешнейПечатнойФормы = СтрокаТаблицы.КомандаВнешнейПечатнойФормы;
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Дата = ТекущаяДата();
		МенеджерЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры
